In [117]:
import numpy as np
import pandas as pd

In [118]:
train:pd.DataFrame = pd.read_csv("../data/train.csv")
test:pd.DataFrame = pd.read_csv("../data/test.csv")
gender_submission = pd.read_csv('../data/gender_submission.csv')

In [119]:
gender_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [120]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [121]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [122]:
data = pd.concat(
    [train,test],sort=False
)

In [123]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [124]:
print(len(train), len(test),len(data))

891 418 1309

In [125]:
data.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
dtype: int64

In [126]:
data["Sex"].replace(["male", "female"],[0,1], inplace=True)

In [127]:
data["Embarked"].fillna(('S'), inplace=True)
data["Embarked"] = data["Embarked"].map(
    {'S':0, 'C':1, 'Q':2}
).astype(int)

In [128]:
data['Fare'].fillna(
    np.mean(data['Fare']),inplace=True
)

In [129]:
age_avg = data["Age"].mean()
age_std = data["Age"].std()

data['Age'].fillna(
    np.random.randint(
        age_avg - age_std, age_avg + age_std
    ),inplace=True
)

In [130]:
delete_columns =  ['Name', 'PassengerId', 'SibSp', 'Parch', 'Ticket', 'Cabin']
data.drop(
    delete_columns, axis=1, inplace=True
)

In [131]:
data

     Survived  Pclass  Sex   Age      Fare  Embarked
0         0.0       3    0  22.0    7.2500         0
1         1.0       1    1  38.0   71.2833         1
2         1.0       3    1  26.0    7.9250         0
3         1.0       1    1  35.0   53.1000         0
4         0.0       3    0  35.0    8.0500         0
..        ...     ...  ...   ...       ...       ...
413       NaN       3    0  25.0    8.0500         0
414       NaN       1    1  39.0  108.9000         1
415       NaN       3    0  38.5    7.2500         0
416       NaN       3    0  25.0    8.0500         0
417       NaN       3    0  25.0   22.3583         1

[1309 rows x 6 columns]

In [132]:
train = data[:len(train)]
test = data[len(train):]

In [133]:
y_trian = train["Survived"]
X_trian = train.drop("Survived", axis=1)
X_test = test.drop("Survived", axis=1)

In [134]:
X_trian.head()

   Pclass  Sex   Age     Fare  Embarked
0       3    0  22.0   7.2500         0
1       1    1  38.0  71.2833         1
2       3    1  26.0   7.9250         0
3       1    1  35.0  53.1000         0
4       3    0  35.0   8.0500         0

In [135]:
y_trian.head()

0    0.0
1    1.0
2    1.0
3    1.0
4    0.0
Name: Survived, dtype: float64

In [136]:
from sklearn.linear_model import LogisticRegression

In [137]:
clf = LogisticRegression(
    penalty='l2', solver="sag", random_state=0
)

In [138]:
clf.fit(X_trian, y_trian)

/opt/conda/lib/python3.9/site-packages/sklearn/linear_model/_sag.py:352: ConvergenceWarning: The max_iter was reached which means the coef_ did not converge
  warnings.warn(

LogisticRegression(random_state=0, solver='sag')

In [139]:
y_pred = clf.predict(
    X_test
)

In [140]:
y_pred[:20]

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0.,
       0., 0., 0.])

In [141]:
sub = pd.read_csv(
    "../data/gender_submission.csv"
)

In [142]:
sub["Survived"] = list(
    map(int, y_pred)
)

In [143]:
sub.to_csv(
    "../data/submission.csv", index=False
)